import pyttsx3
def text_to_speech(text):
    engine = pyttsx3.init()
    engine.setProperty('rate', 115)
    engine.say(text)
    engine.runAndWait()


#создание списка стимулов-слов
stringg = '''пар—1
ров—1
жар—1
пол—1
вор—1
лёд—1
лов—1
род—1
жир—2
рог—2
вид—2
рок—2
пот—2
шов—2
рай—2
сэр—2
поэт—3
кэб—3
выдра—3
ёлка—3
сёрф—3
пух—3
жук—3
люк—3
выбор—4
игра—4
край—4
заря—4
часы—4
жюри—4
ёжик—4
фига—4
цена—5
язык—5
пират—5
пролил—5
хорёк—5
щука—5
цирк—5
глыба—5
ключ—5
кроха—5
кофта—5
миля—5
поворот—6
фонарь—6
цокот—6
якорь—6
гамак—6
закат—6
шить—6
щипок—6
зараза—7
жизнь—7
храпят—7
купец—7
запрет—7
съезд—7
хлопоты—7
яхонт—7
щавель—7
продукт—8
подъезд—8
курица—8
японец—8
цыплята—8
попугай—8
съёмка—8
стирка—8
цыплёнок—9
сыграть—9
бублик—9
бабушка—10
чечётка—10
миниатюра—13'''

words = {}
ind = 0
for line in stringg.split("\n"):
    ind+=1
    word=line.split('—')[0]
    num = line.split('—')[1]
    words[word] = int(num)
word_compl=dict(sorted(words.items(), key=lambda item: item[1]))
words_sorted = list(word_compl.keys())



#создание списка предложений
stringg = '''Класс зашумел.
Птицы живут в лесах.
Рыболов поймал в реке щуку.
От учтивых слов язык не отсохнет.
Море глухо роптало и билось о берег.
Сад тихонько зашумел листвой и замер.
Маша прочитает книгу о путешествиях.
Ночью ударил мороз и заморозил цветы.
Школьники путешествуют по родному краю.
Старшеклассники участвуют в лыжных соревнованиях.
Мне 12 лет.
Ему было 76 лет.
У него было 3 кошки.
Это произошло в 1496 году.
Война длилась с 1398 по 1425.
Я хожу в бассейн 5 раз в неделю.
Она была в этом городе раз 7 или 8.
Моя работа вышла в 10 раз больше.
Это фильм для зрителей старше 20 лет.
Запишите мой номер: 49 351 082 60 73.
Звёзды меркнут, гаснут.
Вы у меня в гостях, ребята.
Зацвели одуванчики, шиповник.
Тракторы пашут, разрыхляют почву.
В болоте урчали, квакали лягушки.
На столе лежали книги, тетради, карандаши.
В лесу росли ландыши, фиалки, колокольчики.
Мы показали на выставке, что мы умеем делать.
Осенние листья летят, кружатся, падают на землю.
В лесном озере водились караси, плотва, щуки, лещи.
Серебряные паутинки опускались на деревья, на кусты.
Славная осень!
Дорогие ребята!
Ах ты, обжора!
Привет, Кирилл!
Стой, братцы, стой!
Граждане пассажиры!
Увы, я разбито, разбито!
Дайте два больших пенала!
Ступайте, ребята, за мной!
Я у самого Юлия Цезаря в почёте был!
Далеко?
А куда ты идёшь?
Куда же они летят?
Что же было на выставке?
Какие части есть у растения?
А ты что ж, кумушка, в дорогу?
Ты опять завтракаешь на уроке?
Что с вами приключилось, друзья?
Какие птицы улетают на юг осенью?
Почему же происходит извержение вулкана?
"Абсолютно верно!" - сказал учитель.
"Стой, братцы, стой!" - кричит Мартышка.
Мы попросили лесника: "Проводи нас, дедушка".
"Кто ты? Что делаешь?" - спросил сердито Лев.
"Ешьте, ребята, яблоки", - предложил нам лесник.
Этот поезд останавливается на станции "Аэропорт"?
"Что это?" - спросил вдруг Костя, приподняв голову.
"Куда так, кумушка, бежишь ты без оглядки?" - Лисицу спрашивал Сурок.
"Кумушка, мне странно это: да работала ль ты в лето?" - говорит ей Муравей.
Максим Горький писал: "Обогащайте себя знанием русского языка, читайте больше".'''

sents = []
ind = 0
for line in stringg.split("\n"):
    ind+=1
    sents.append(line)


############################
#случайные предложения
############################

words_r = "радостный, страстный, полновластный, счастливый, гигантский, буревестник, тростник, вестник, известняк, неизвестность, присутствие, пастбище, сверстник, отсутствие, агентство, празднество, поздно, объездчик, мундштук, громоздкий, шестнадцать, сумасшедший, уздцы, ягдташ, лестница, масштаб, монпансье, ассистент, диссертация, дискуссия, экспресс, стюардесса, колоссальный, гроссмейстер, кроссовки, матросский, рассчитать, колледж, коллега, коллоквиум, интеллигенция, аллегро, троллейбус, артиллерия, целлюлоза, целлофан, галлюцинация, аппетит, аппарат, труппа, группа, оппонент, диаграмма, комментарий, коммюнике, программа, симметрия, иммунитет, килограмм, он приготовится к прыжку, киньте мячик, составь уравнение, назначьте свидание, признаться в слабости, съешьте кусочек, ребёнок купается, хочу купаться в море, ты шуршишь бумагами, ты несёшься напролом, ты бросишь камень, отречься от сказанного, собака сильно кусается, щенок может кусаться, пришлось добираться пешком, лист не колышется, занимается заря, пора заниматься, придётся задуматься, ты пишешь красиво, не откажите в просьбе, возьми богатырский меч, получите деньги, заботливая нянька, красивая тесьма, пора поведать о судьбе героя, пораньше встаньте, необходимо закончить в срок, достаньте багаж, надо распахнуть дверь настежь, крыши загородных дач, придётся нанять носильщика, отсветы пожарищ, длительная болезнь, милый лжец, кисть рябины, тенистая аллея, мощный рывок, отсрочьте платёж, дощатый мостик, изъявить, конъюнктура, субъект, трёхэтажный, двухъярусный, панъевропейский, съезд, сверхъестественный, объединение, сэкономить, съязвить, объяснение, разъединение, двухъязычный, межъязыковой, объезженный, предъюбилейный, сузить, съязвить, объятия, киносъёмка, небезызвестный автор, безыскусный рассказ, подытожить расходы, небезынтересный факт, изыскать резервы, строгий фининспектор, дезинформировать население, безысходная печаль, сверхизобретательный человек, сверхъестественная сила, удачная контригра, предъянварские морозы, сверхизысканный вкус, получить спортинвентарь, предъявить документ, отыграть первый период, поступать в пединститут, сверхимпульсивный пациент, съесть шампиньон, межинститутский референдум, работать безынициативно, чувство безысходности, отыскать подлинник, беспорядочная стрельба, бессильная ярость, бездарный артист, бестолковый ответ, возглас удивления, расфасовать продукты, исхоженные тропы, изношенный механизм, расхожий аргумент, исследовать причины, ниспосланная милость, раскидать вещи, воспетый поэтом, воздать должное, воспылать страстью, испорченные нервы, исковерканная судьба, чрезмерные усилия, вскружить голову, вздремнуть немного, взгрустнуть о былом, предрассветная мгла, бесформенные очертания, приручить дикарку, привокзальная площадь, приоткрывать завесу, преобразованный край, приобщаться к культуре, пресекать попытки, препротивный разговор, приоткрывать глазок, прибить доску, приусадебный участок, пристегнуть значок, пригладить вихры, притворить окно, приблизиться на шаг, седой привратник, привокзальная площадь, преувеличенное мнение, преодолеть преграды, искать пристанища, присоединиться к мнению, прищурить глаза, прибить к потолку, претоненькие ножки, приманить рыбёшку, прибрежные камыши, явное преувеличение, престарелый житель, приехать в Приднестровье, презабавный анекдот, пригородный поезд, приберечь монетки, превосходный рассказчик, прицепить крючок, прекрасная царевна, прихлопнуть муху, приглушить звук, приближённый ко двору, утиный, гостиный, барабанный, стеклянный, соломенный, лекарственный, клюквенный, весенний, ледяной, ранний, конный, временный, оловянный, румяный, багряный, каменный, деревянный, ветреный, осенний, змеиный, безветренный, обветренный, свиной, серебряный, славяно-греко-латинский, сложноподчинённое, сложносочинённое, снежно-белый, сновидение, сногсшибательный, сон-трава, сорвиголова, сорокаведёрный, социал-демократ, социально-опасный, среднеазиатский, старорусский, старославянский, стереотипный, стихийно-бунтарский, стокилометровый, старозаветный, строительно-монтажный, театроведение, театр-студия, телеграфно-телефонный, тёмно-бордовый, тёмноволосый, теоретически важный, техминимум, товарно-пассажирский, торгово-промышленный, тяжелобольной, тяжело дышащий, тяжелораненый, умалишённый, учебно-воспитательный, феодально-крепостнический, физкультура, формально-грамматический, формально-логический, формообразование, хладнокровный, хладостойкий, хлебобулочный, художественно полноценный, царь-девица, царь-пушка, чёрно-бурый, чёрносмородинный, четвертьфинал, чистоплотный, чистосердечие, широкодоступный, экспортно-импортный, экспрессивно окрашенный, юго-запад, явно неудачный, ярко-зелёный, ярко освещённый, ясно выраженный, дифирамб, маринад, минорный, ореол, респиратор, приоритет, триумфальный, нумерация, преамбула, регата, резонанс, рикошет, скомпонованный, фантасмагория, ювелир, фрикаделька, фиаско, сталактит, торшер, синтагма, соната, ренегат, ностальгия, омонимия, кастрюля, экстравагантный, эпистолярный, фламинго, коростель, тротуар, тотализатор, серпантин, рудимент, презентабельный, начинать работу, блестеть на солнце, замереть от счастья, замирать от страха, собирательный образ, блестящий оратор, избирательная кампания, предлагать помощь, наклонить голову, заровнять канаву, вырастить цветы, первое склонение, земная равнина, далёкая зарница, растирание красок, сочетание теории с практикой, проскакать на лошади, проскочить мимо, обмакнуть вареник в сметану, вымокнуть под дождём, поклоняться солнцу, отраслевое производство, вскакивать на ходу, заносчивый выскочка, заскочить на минуту, рассчитывать на помощь, произвести расчёт, тяжёлая сумка, чопорный человек, покрыться румянцем, жёсткие условия, старый чёлн, лесные шорохи, трещотка сторожа, ожог лица, решётка сада, трудолюбивые пчёлы, укрыться плащом, мраморный цоколь, городские трущобы, жёлтые листья, бочонок с водой, спорить горячо, шов разошёлся, идти вдоль шоссе, поджог сарая, вощёная бумага, грошовая опера"

words5 = words_r.split(', ')

